memory/proposals/mutation-notify-hyperagent-20260418_064220.diff
--- a/scripts/notify-hyperagent.sh
+++ b/scripts/notify-hyperagent.sh
@@ -60,21 +60,35 @@ send_telegram() {
     local escaped
     escaped=$(json_escape "$message")
     local payload="{\"chat_id\":\"$TELEGRAM_CHAT_ID\",\"text\":$escaped,\"parse_mode\":\"HTML\"}"
 
-    local http_code
-    http_code=$(curl -sS -o /tmp/telegram-notify-response.json -w "%{http_code}" \
-        -X POST "https://api.telegram.org/bot${token}/sendMessage" \
-        -H "Content-Type: application/json" \
-        -d "$payload" 2>/dev/null || echo "000")
-
-    if [ "$http_code" = "200" ]; then
-        log_event "delivered" "\"httpCode\":$http_code"
-        return 0
-    else
-        log_event "failed" "\"httpCode\":$http_code"
-        return 1
-    fi
+    local attempt=1
+    local max_attempts=3
+    local delay=2
+
+    while [ "$attempt" -le "$max_attempts" ]; do
+        local http_code
+        http_code=$(curl -sS -o /tmp/telegram-notify-response.json -w "%{http_code}" \
+            -X POST "https://api.telegram.org/bot${token}/sendMessage" \
+            -H "Content-Type: application/json" \
+            -d "$payload" 2>/dev/null || echo "000")
+
+        if [ "$http_code" = "200" ]; then
+            log_event "delivered" "\"httpCode\":$http_code" "\"attempt\":$attempt"
+            return 0
+        elif [[ "$http_code" =~ ^(429|5[0-9][0-9])$ ]] && [ "$attempt" -lt "$max_attempts" ]; then
+            log_event "retrying" "\"httpCode\":$http_code" "\"attempt\":$attempt"
+            sleep "$delay"
+            delay=$((delay * 2))
+            attempt=$((attempt + 1))
+        else
+            log_event "failed" "\"httpCode\":$http_code" "\"attempt\":$attempt"
+            return 1
+        fi
+    done
+
+    return 1
 }
 
 # ─── 메인: state에서 결과 추출 → 메시지 조립 ───
